name: "detr_onnx"
platform: "onnxruntime_onnx"
max_batch_size: 0
input [
    {
        name: "pixel_values"
        data_type: TYPE_FP32
        dims: [ -1, 3, 750, 1333 ]
    }
]
output [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ -1, -1, 92 ]
    },
    {
        name: "pred_boxes"
        data_type: TYPE_FP32
        dims: [ -1, -1, 4 ]
    }
]
dynamic_batching { }
instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]
model_warmup [
    {
        name : "DETR Warmup Sample"
        batch_size: 1
        inputs {
            key: "pixel_values"
            value: {
                data_type: TYPE_FP32
                dims: [ 8, 3, 750, 1333 ]
                random_data: true
            }
        }
        count: 5
    }
]
# Pure ONNX Runtime
optimization {
    graph : {
        level : 2
    }
}
# ONNX runtime with TensorRT
# optimization { execution_accelerators {
#     gpu_execution_accelerator : [
#         {
#             name : "tensorrt"
#             parameters { key: "precision_mode" value: "FP32" }
#             parameters { key: "max_workspace_size_bytes" value: "4294967296" }
#             parameters { key: "trt_engine_cache_enable" value: "1" }
#         }
#     ]
# }}
