name: "ensemble_single_onnx"
platform: "ensemble"
max_batch_size: 0
input [
    {
        name: "input_image"
        data_type: TYPE_FP32
        dims: [ -1, 3, 1080, 1920 ]
    }
]
output [
    {
        name: "output_image"
        data_type: TYPE_FP32
        dims: [ -1, 3, -1, -1 ]
    }
]
ensemble_scheduling {
    step [
        {
            model_name: "simple_cnn_l1"
            model_version: -1
            input_map {
                key: "input_image"
                value: "input_image"
            }
            output_map {
                key: "output_image"
                value: "output_image"
            }
        }
    ]
}
