name: "detr_postprocessing"
backend: "python"
max_batch_size: 0
input [
    {
        name: "logits"
        data_type: TYPE_FP32
        dims: [ -1, -1, 92]
    },
    {
        name: "pred_boxes"
        data_type: TYPE_FP32
        dims: [ -1, -1, 4 ]
    }
]
output [
    {
        name: "scores"
        data_type: TYPE_FP32
        dims: [ -1, -1, 1 ]
    },
    {
        name: "labels"
        data_type: TYPE_INT64
        dims: [ -1, -1, 1 ]
    },
    {
        name: "boxes"
        data_type: TYPE_FP32
        dims: [ -1, -1, 4 ]
    }
]
instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]
model_warmup [
    {
        name : "DETR Warmup Sample"
        batch_size: 1
        inputs {
            key: "logits"
            value: {
                data_type: TYPE_FP32
                dims: [ 8, 100, 92 ]
                random_data: true
            }
        }
        inputs {
            key: "pred_boxes"
            value: {
                data_type: TYPE_FP32
                dims: [ 8, 100, 4 ]
                random_data: true
            }
        }
        count: 5
    }
]