name: "all_in_one_detr"
backend: "python"
max_batch_size: 0
input [
    {
        name: "image"
        data_type: TYPE_UINT8
        dims: [ -1, 3, 1080, 1920 ]
    }
]
output [
    {
        name: "scores"
        data_type: TYPE_FP32
        dims: [ -1, -1,  1 ]
    },
    {
        name: "labels"
        data_type: TYPE_INT64
        dims: [ -1, -1, 1 ]
    },
    {
        name: "boxes"
        data_type: TYPE_FP32
        dims: [ -1, -1, 4 ]
    }
]
instance_group [
    {
      count: 1
      kind: KIND_GPU
    }
]
model_warmup [
    {
        name : "DETR Warmup Sample"
        batch_size: 1
        inputs {
            key: "image"
            value: {
                data_type: TYPE_UINT8
                dims: [ 8, 3, 1080, 1920 ]
                random_data: true
            }
        }
        count: 5
    }
]