name: "ensemble_cnn_4"
platform: "ensemble"
max_batch_size: 0
input [
    {
        name: "l_image_tensor_"
        data_type: TYPE_FP32
        dims: [ -1, 3, 1080, 1920 ]
    }
]
output [
    {
        name: "relu_2"
        data_type: TYPE_FP32
        dims: [ -1, 3, -1, -1 ]
    }
]
ensemble_scheduling {
    step [
        {
            model_name: "simple_cnn"
            model_version: -1
            input_map {
                key: "l_image_tensor_"
                value: "l_image_tensor_"
            }
            output_map {
                key: "relu_2"
                value: "image_output_m1"
            }
        },
        {
            model_name: "simple_cnn"
            model_version: -1
            input_map {
                key: "l_image_tensor_"
                value: "image_output_m1"
            }
            output_map {
                key: "relu_2"
                value: "image_output_m2"
            }
        },
        {
            model_name: "simple_cnn"
            model_version: -1
            input_map {
                key: "l_image_tensor_"
                value: "image_output_m2"
            }
            output_map {
                key: "relu_2"
                value: "image_output_m3"
            }
        },
        {
            model_name: "simple_cnn"
            model_version: -1
            input_map {
                key: "l_image_tensor_"
                value: "image_output_m3"
            }
            output_map {
                key: "relu_2"
                value: "relu_2"
            }
        }
    ]
}
